#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/l00163105/l00163105-workspace/runs/run-xsu1ptLfkXccQG2n

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.compute.aws_elastic_beanstalk_application.app_instance will be created
  + resource "aws_elastic_beanstalk_application" "app_instance" {
      + arn         = (known after apply)
      + description = "SmallWindow21"
      + id          = (known after apply)
      + name        = "SmallWindow21"
      + tags_all    = (known after apply)
    }

  # module.compute.aws_elastic_beanstalk_environment.app_instance_environment will be created
  + resource "aws_elastic_beanstalk_environment" "app_instance_environment" {
      + all_settings           = (known after apply)
      + application            = "SmallWindow21"
      + arn                    = (known after apply)
      + autoscaling_groups     = (known after apply)
      + cname                  = (known after apply)
      + cname_prefix           = (known after apply)
      + endpoint_url           = (known after apply)
      + id                     = (known after apply)
      + instances              = (known after apply)
      + launch_configurations  = (known after apply)
      + load_balancers         = (known after apply)
      + name                   = "smallwindow21-dev"
      + platform_arn           = (known after apply)
      + queues                 = (known after apply)
      + solution_stack_name    = "64bit Amazon Linux 2018.03 v2.16.8 running Docker 19.03.13-ce"
      + tags                   = {
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all               = {
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tier                   = "WebServer"
      + triggers               = (known after apply)
      + version_label          = (known after apply)
      + wait_for_ready_timeout = "20m"

      + setting {
          + name      = "ELBSubnets"
          + namespace = "aws:ec2:vpc"
          + value     = (known after apply)
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = (known after apply)
        }
      + setting {
          + name      = "InstanceTypes"
          + namespace = "aws:ec2:instances"
          + value     = "t2.micro"
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      + setting {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      + setting {
          + name      = "SecurityGroups"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = (known after apply)
        }
      + setting {
          + name      = "SecurityGroups"
          + namespace = "aws:elbv2:loadbalancer"
          + value     = (known after apply)
        }
      + setting {
          + name      = "Subnets"
          + namespace = "aws:ec2:vpc"
          + value     = (known after apply)
        }
      + setting {
          + name      = "VPCId"
          + namespace = "aws:ec2:vpc"
          + value     = (known after apply)
        }
      + setting {
          + name      = "db_address"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = (known after apply)
        }
      + setting {
          + name      = "db_endpoint"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = (known after apply)
        }
      + setting {
          + name      = "db_password"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = (known after apply)
        }
      + setting {
          + name      = "db_port"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = (known after apply)
        }
      + setting {
          + name      = "db_username"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "smallwindow21"
        }
      + setting {
          + name      = "storage_bucket_name"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = (known after apply)
        }
    }

  # module.database.aws_db_instance.db_instance will be created
  + resource "aws_db_instance" "db_instance" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "smallwindow21-dbsubnet-group"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "smallwindow21db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "smallwindow21db"
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name"    = "smallwindow21db"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all                              = {
          + "Name"    = "smallwindow21db"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + timezone                              = (known after apply)
      + username                              = "smallwindow21"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.database.aws_db_subnet_group.db_subnet_group will be created
  + resource "aws_db_subnet_group" "db_subnet_group" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "smallwindow21-dbsubnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name" = "smallwindow21-dbsubnet-group"
        }
      + tags_all    = {
          + "Name" = "smallwindow21-dbsubnet-group"
        }
    }

  # module.database.random_string.db_password will be created
  + resource "random_string" "db_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.networking.aws_eip.nat_elastic_ip will be created
  + resource "aws_eip" "nat_elastic_ip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"    = "Small Window 21"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all             = {
          + "Name"    = "Small Window 21"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + vpc                  = true
    }

  # module.networking.aws_internet_gateway.inet_gateway will be created
  + resource "aws_internet_gateway" "inet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"    = "Small Window 21"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all = {
          + "Name"    = "Small Window 21"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_nat_gateway.nat_gateway will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"    = "Small Window 21"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all             = {
          + "Name"    = "Small Window 21"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
    }

  # module.networking.aws_route_table.private_routing_table will be created
  + resource "aws_route_table" "private_routing_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"    = "Small Window 21"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all         = {
          + "Name"    = "Small Window 21"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.public_routing_table will be created
  + resource "aws_route_table" "public_routing_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"    = "Small Window 21"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all         = {
          + "Name"    = "Small Window 21"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.private_routing_table_assoc_app will be created
  + resource "aws_route_table_association" "private_routing_table_assoc_app" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_routing_table_assoc_dbase_1 will be created
  + resource "aws_route_table_association" "private_routing_table_assoc_dbase_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_routing_table_assoc_dbase_2 will be created
  + resource "aws_route_table_association" "private_routing_table_assoc_dbase_2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_routing_table_assoc will be created
  + resource "aws_route_table_association" "public_routing_table_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_subnet.private_subnet_app will be created
  + resource "aws_subnet" "private_subnet_app" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"    = "Private Subnet - Small Window 21 - App"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all                        = {
          + "Name"    = "Private Subnet - Small Window 21 - App"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.private_subnet_dbase_1 will be created
  + resource "aws_subnet" "private_subnet_dbase_1" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"    = "Private Subnet - Small Window 21 - Dbase 1"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all                        = {
          + "Name"    = "Private Subnet - Small Window 21 - Dbase 1"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.private_subnet_dbase_2 will be created
  + resource "aws_subnet" "private_subnet_dbase_2" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.4.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"    = "Private Subnet - Small Window 21 - Dbase 2"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all                        = {
          + "Name"    = "Private Subnet - Small Window 21 - Dbase 2"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.public_subnet will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"    = "Public Subnet - Small Window 21 Public Subnet"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all                        = {
          + "Name"    = "Public Subnet - Small Window 21 Public Subnet"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "192.168.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name"    = "Small Window 21 VPC"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all                         = {
          + "Name"    = "Small Window 21 VPC"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
    }

  # module.security.aws_iam_instance_profile.eb_profile will be created
  + resource "aws_iam_instance_profile" "eb_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "SmallWindow21-Profile"
      + path        = "/"
      + role        = "SmallWindow21-Role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.security.aws_iam_role.eb_role will be created
  + resource "aws_iam_role" "eb_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SmallWindow21-Role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.security.aws_security_group.app_sg will be created
  + resource "aws_security_group" "app_sg" {
      + arn                    = (known after apply)
      + description            = "SSH ingress from Bastion and all TCP traffic ingress from ALB Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "App Security Group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "App Security Group"
          + "project" = "Small Window 21"
        }
      + tags_all               = {
          + "Name"    = "App Security Group"
          + "project" = "Small Window 21"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security.aws_security_group.dbase_sg will be created
  + resource "aws_security_group" "dbase_sg" {
      + arn                    = (known after apply)
      + description            = "Allow traffic from app instance to database on port 3306"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Database Security Group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "Database Security Group"
          + "project" = "Small Window 21"
        }
      + tags_all               = {
          + "Name"    = "Database Security Group"
          + "project" = "Small Window 21"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security.aws_security_group.general_sg will be created
  + resource "aws_security_group" "general_sg" {
      + arn                    = (known after apply)
      + description            = "HTTP egress to anywhere"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "General Security Group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "General Security Group"
          + "project" = "Small Window 21"
        }
      + tags_all               = {
          + "Name"    = "General Security Group"
          + "project" = "Small Window 21"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security.aws_security_group_rule.in_database_from_app will be created
  + resource "aws_security_group_rule" "in_database_from_app" {
      + description              = "Allow traffic on port 3306 from the App Security Group"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.security.aws_security_group_rule.out_database_from_app will be created
  + resource "aws_security_group_rule" "out_database_from_app" {
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "egress"
    }

  # module.security.aws_security_group_rule.out_http will be created
  + resource "aws_security_group_rule" "out_http" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.security.aws_security_group_rule.out_http_app will be created
  + resource "aws_security_group_rule" "out_http_app" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow TCP internet traffic egress from app layer"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.storage.aws_s3_bucket.storage_bucket will be created
  + resource "aws_s3_bucket" "storage_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "smallwindow21-eu-west-1-641469155832"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"    = "smallwindow21-eu-west-1-641469155832"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all                    = {
          + "Name"    = "smallwindow21-eu-west-1-641469155832"
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dbase_instance_address                     = (known after apply)
  + dbase_instance_endpoint                    = (known after apply)
  + dbase_instance_port                        = (known after apply)
  + elasticbeanstalk_app_cname                 = (known after apply)
  + elasticbeanstalk_app_loadbalancer_endpoint = (known after apply)
  + storage_bucket_name                        = (known after apply)

```

</details>

*Pusher: @L00163105, Action: `pull_request`*